[
  {
    "Id": 1,
    "Name": "Daniel Brown",
    "Role": "Faculty Members",
    "Alumni": false,
    "Homepage": "https://users.cs.utah.edu/~dsbrown",
    "Scholar": "https://scholar.google.com/citations?hl=en&user=A3wg18wAAAAJ&view_op=list_works&sortby=pubdate",
    "Github": "",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I'm an assistant professor in the Kahlert School of Computing and the Robotics Center at the University of Utah. I completed my postdoc at UC Berkeley in 2022 and received my Ph.D. in Computer Science from UT Austin in 2020. My research broadly focuses on human-centered AI and human-AI alignment. My goal is to develop robots and other AI systems that can safely and efficiently interact with, learn from, teach, and empower human users. My lab's research spans the areas of human-robot interaction, reward and preference learning, human-in-the-loop machine learning, and AI safety. I am interested in applications in assistive, rehab, and surgical robotics, personal AI assistants, swarm robotics, and autonomous driving."
  },
  {
    "Id": 2,
    "Name": "Connor Mattson",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "https://users.cs.utah.edu/~cmattson",
    "Scholar": "https://scholar.google.com/citations?user=mQgtCDAAAAAJ&hl=en",
    "Github": "https://github.com/Connor-Mattson",
    "Twitter": "https://x.com/connormat",
    "LinkedIn": "https://www.linkedin.com/in/connorgmattson/",
    "Bio": "I am a second year Ph.D. Robotics Student in the Robotics Center and Kahlert School of Computing at the University of Utah. My primary research interests are Human-Robot Interaction, Multi-Agent RLHF, and Swarm Robotics. Currently I'm researching how machine learning can help humans understand what their robots are capable of, how we can efficiently leverage human input to teach multi-robot systems how to perform tasks, and how to share control of high-DoF robots between human teleoperators and AI. After my Ph.D., I plan to continue my research in a tenure-track faculty position at a research-focused university."
  },
  {
    "Id": 3,
    "Name": "Eric Brewer",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "",
    "Github": "https://github.com/EricRobertBrewer",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I’m generally interested in learning algorithms, i.e., reinforcement learning, especially regarding perception."
  },
  {
    "Id": 4,
    "Name": "Zohre Karimi",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "https://zohre-karimi.github.io",
    "Scholar": "",
    "Github": "",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I am a third-year Ph.D. student in Robotics at the Kahlert School of Computing, University of Utah supervised by Dr. Daniel Brown. My research centers on Human-Robot Interaction and Surgical Robotics. To be more specific I am working on developing advanced reward learning techniques and imitation learning algorithms to enhance the capabilities of autonomous systems in surgical robotics. By integrating machine learning with robotics, I aim to improve precision, safety, and efficiency in robotic-assisted surgeries. In addition to this, I am engaged in projects exploring shared control between robots and humans, aiming to enhance collaborative interactions across various domains."
  },
  {
    "Id": 5,
    "Name": "Atharv Belsare",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "",
    "Github": "",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I am a first year Ph.D. student in Computer Science at the Kahlert School of Computing. My research interests include Human-Robot Interaction and Assistive Robotics."
  },
  {
    "Id": 6,
    "Name": "Zifan Wu",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "https://scholar.google.com/citations?user=cHCsqP8AAAAJ&hl",
    "Github": "https://github.com/zifanwu",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I am a first-year Ph.D. student at the University of Utah. My primary research focus is on Deep Reinforcement Learning (DRL). Specifically, I've been investigating methods to improve the sample efficiency and safety of DRL algorithms. To that end, I delve into fields such as model-based RL, offline RL, constrained RL, and also representation learning. Currently I'm interested in studying the relationship between the data distribution shift during policy learning and the plasticity loss in the policy network (inability to adapt to unseen data distributions)."
  },
  {
    "Id": 7,
    "Name": "Ali Larian",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "",
    "Github": "https://github.com/Alilarian",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I am a PhD student at the University of Utah, working under the supervision of Dr. Daniel Brown. My research focuses on designing and implementing models that enable robots to self-assess their performance and operate independently of human supervision, while remaining aligned with human objectives. To achieve this, I use a variety of tools, including Reinforcement Learning (RL), Inverse Reinforcement Learning (IRL), Bayesian IRL, and learning from different types of human feedback. In my free time, you can find me playing tennis or swimming. I also enjoy reading and discussing topics related to economics."
  },
  {
    "Id": 8,
    "Name": "Akansha Kalra",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "https://akansha-kalra.github.io",
    "Scholar": "https://scholar.google.com/citations?user=QrkO660AAAAJ&hl=en",
    "Github": "https://github.com/akansha-kalra",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I'm a PhD student in the CS program advised by Dr. Daniel Brown. I graduated with an MS in Electrical and Computer Engineering from Carnegie Mellon University."
  },
  {
    "Id": 9,
    "Name": "Varun Raveendra",
    "Role": "PhD Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "",
    "Github": "https://github.com/varunraveendra",
    "Twitter": "",
    "LinkedIn": "https://www.linkedin.com/in/varun-robotics",
    "Bio": "I am a PhD student at the University of Utah. My research interests include Reinforcement Learning with Robots, RLHF, Swarm Robots, and Multi-Agent Robots."
  },
  {
    "Id": 10,
    "Name": "Seongil Heo",
    "Role": "Graduate Students",
    "Alumni": false,
    "Homepage": "https://seongil-heo.com",
    "Scholar": "",
    "Github": "https://github.com/seongilHeo",
    "Twitter": "",
    "LinkedIn": "https://www.linkedin.com/in/seongil-heo",
    "Bio": "I am a first-year M.S. student in Computer Science at the University of Utah. I am advised by Professor Daniel Brown and conduct research focusing on multi-agent systems and Swarm Robotics."
  },
  {
    "Id": 11,
    "Name": "Parth Bhandari",
    "Role": "Graduate Students",
    "Alumni": false,
    "Homepage": "",
    "Scholar": "",
    "Github": "https://github.com/parthbhandari1",
    "Twitter": "",
    "LinkedIn": "https://www.linkedin.com/in/parthbhandari",
    "Bio": "I am a first-year M.S. student majoring in Computer Science, working under the supervision of Dr. Daniel Brown. My research interests include Generative AI, Large Language Models, and I have experience with recommendation systems and conversational chatbots."
  },
  {
    "Id": 12,
    "Name": "Thomas Fenno",
    "Role": "Undergraduate Students",
    "Alumni": false,
    "Homepage": "https://github.com/tomfenno",
    "Scholar": "",
    "Github": "https://github.com/tomfenno",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I'm an undergraduate student at the University of Utah majoring in Computer Science with a minor in Cognitive Science. My interests lie in AI Human-AI inter and AI safety. Currently, I'm working on research related to goal inference capabilities of AI agents by analyzing human behavior in dynamic environments, under the guidance of Dr. Daniel S. Brown. My long-term goal is to pursue a PhD and contribute to advancing AI in ways that are provably beneficial to citizens."
  },
  {
    "Id": 13,
    "Name": "Anda Xie",
    "Role": "Undergraduate Students",
    "Alumni": true,
    "Homepage": "",
    "Scholar": "",
    "Github": "https://github.com/SussyTestAccount",
    "Twitter": "",
    "LinkedIn": "",
    "Bio": "I am a High School Junior at West High School volunteering as an intern at the Kahlert School of Computing at the University of Utah. In the summer of 2024, I worked in Professor Daniel Brown’s research laboratory assisting in the construction of swarm robots for research in emergent behavior as well as the operation of a ROS control system. I am interested in both software and hardware development. I plan to pursue an undergraduate degree in EE at a research focused university before graduate school."
  }
]